[{"id":"3","title":"3D User Interfaces with Java 3D","imageUrl":"https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/barrilleaux.jpg","price":"199","description":"3D User Interfaces with Java 3D is a practical guide for providing next-generation applications with 3D user interfaces for manipulation of in-scene objects. Emphasis is on standalone and web-based business applications, such as for online sales and mass customization, but much of what this book offers has broad applicability to 3D user interfaces in other pursuits such as scientific visualization and gaming. "},{"id":"4","title":"MongoDB in Action","imageUrl":"https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/banker.jpg","price":"802","description":"MongoDB is a document-oriented database that's highly scalable and delivers very high-performance, especially with massive data sets that need to be spread across multiple servers. It blends the things you expect with any database   like indexing, querying, and high availability   with powerful new features like easy horizontal scaling , map/reduce aggregation, and a flexible document data model to support dynamic schemas."},{"id":"0.4463265800763083","title":"Unlocking Android","imageUrl":"https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/ableson.jpg","price":"688","description":"Android is an open source mobile phone platform based on the Linux operating system and developed by the Open Handset Alliance, a consortium of over 30 hardware, software and telecom companies that focus on open standards for mobile devices"},{"id":"0.7896852411232207","title":"Collective Intelligence in Action","imageUrl":"https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/alag.jpg","price":"597","description":"There's a great deal of wisdom in a crowd, but how do you listen to a thousand people talking at once  Identifying the wants, needs, and knowledge of internet users can be like listening to a mob."},{"id":"0.4722530523071864","title":"Visual Object Oriented Programming","imageUrl":"https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/burnett.jpg","price":"325","description":"This first book on the union of two rapidly growing approaches to programming--visual programming and object technology--provides a window on a subject of increasing commercial importance."},{"id":"0.7579562136747711","title":"Graphics File Formats","imageUrl":"https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/brown.jpg","price":"432","description":"Graphics File Formats is a comprehensive guide to the file formats used in computer graphics and related areas. "},{"id":"0.7507253814717021","title":"The Well-Grounded Rubyist","imageUrl":"https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/black2.jpg","price":"652","description":"What would appear to be the most complex topic of the book is in fact surprisingly easy to assimilate, and one realizes that the efforts of the author to gradually lead us to a sufficient knowledge of Ruby in order to tackle without pain the most difficult subjects, bears its fruit."},{"id":"0.13432012812711647","title":"Coffeehouse","imageUrl":"https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/asher.jpg","price":"550","description":"Coffeehouse is an anthology of stories, poems and essays originally published on the World Wide Web."},{"id":"0.24849797864151357","title":"Code Generation in Action","imageUrl":"https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/herrington.jpg","price":"352","description":"Code Generation In Action covers building database access, user interface, remote procedure, test cases, and business logic code as well as code for other key system functions."},{"id":"0.8699015549413833","title":"Distributed Agile in Action","imageUrl":"https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/hazrati.jpg","price":"987","description":"Distributed Agile in Action is the first book to directly address the unique task of going Agile in a distributed team. Rather than rehashing Agile theories, this book supplies the practical examples and step by step advice you need to help your distributed teams adopt and embrace Agile principles. It's a distilled and carefully organized learning aid for working in a distributed Agile environment, with in-depth focus on how to approach three critical components of development-People, Process and Technology."}]